Documents/УстановкаИндивидуальныхЦенНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>УстановкаИндивидуальныхЦенНоменклатуры</Name>
			<Comment>Установка индивидуальных цен номенклатуры (для продажи)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныНоменклатурыИндивидуальные</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийУстановкиИндивидуальныхЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеРегистрироватьНулевыеЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Comment>#7274</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наценка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатурыИндивидуальные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатурыИндивидуальные</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наценка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отменена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЦеныПоставщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЦеныПоставщиков</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦеныПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦенПоставщиков</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/Закупки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>Закупки</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УДАЛИТЬ_ДокументУстановкиЦены</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановкаЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОперацийУстановкиИндивидуальныхЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОперацийУстановкиИндивидуальныхЦен</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Установка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отмена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/УстановкаИндивидуальныхЦенНоменклатуры/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем СтараяНоменклатура; // Используется в механизмах обработчиков событий табличной части Товары
&НаКлиенте
Перем СтараяХарактеристика; // Используется в механизмах обработчиков событий табличной части Товары

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Параметры.Ключ.Пустая() Тогда
	Иначе
		ЭтаФорма.ТолькоПросмотр = ПраваПользователей.ДокументТолькоПросмотр(Объект.Ссылка);
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);
	
	УстановкаЦенСервер.ЗаполнитьИспользуемыеВидыЦенПользователя(ЭтаФорма);
	
	УстановитьВидимость();
	
	УстановитьУсловноеОформление();
	ЗагрузитьТабличнуюЧастьТовары();
	
	// Видимость колонки Артикул
	МассивЭлементов = новый Массив();
	МассивЭлементов.Добавить("ДеревоЦенНоменклатураАртикул");
	ОбщийМодульСервер.УстановитьВидимостьКолонкиАртикулВТабличнойЧасти(ЭтаФорма, МассивЭлементов);
	
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПоместитьЦеныВТабличнуюЧасть();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ФормаПодбораНоменклатуры" Тогда	
		ОбработкаПодбораНоменклатурыНаКлиенте(ВыбранноеЗначение);
	//++ №14163
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Обработка.ЗагрузкаНоменклатурыИзExcel.Форма.ЗагрузкаВТабличнуюЧасть" Тогда		
		ПолучитьЗагруженныеТоварыИзХранилища(ВыбранноеЗначение.АдресТоваровВХранилище);
	//-- №14163
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ДатаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	ВалютаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВалютаПриИзмененииНаСервере()
	
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	КонтрагентПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	Объект.ДоговорКонтрагента = Объект.Контрагент.ОсновнойДоговор;
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаСервере
Процедура ДобавитьНоменклатуруНаСервере(Номенклатура)
	Дерево = ДанныеФормыВЗначение(ДеревоЦен, Тип("ДеревоЗначений"));
	
	ЗапросХарактеристики = Новый Запрос;
	ЗапросХарактеристики.Текст = 
	"ВЫБРАТЬ
	|	ХарактеристикиНоменклатуры.Ссылка
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|ГДЕ
	|	ХарактеристикиНоменклатуры.Владелец = &Владелец";
	ЗапросХарактеристики.УстановитьПараметр("Владелец", Номенклатура);
	РезультатЗапросаХарактеристики = ЗапросХарактеристики.Выполнить();
	
	//по всем единицам измерений по данной номенклатуре
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕдиницыИзмерений.Ссылка
	|ИЗ
	|	Справочник.ЕдиницыИзмерений КАК ЕдиницыИзмерений
	|ГДЕ
	|	ЕдиницыИзмерений.Владелец = &Владелец
	|	И ЕдиницыИзмерений.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Владелец", Номенклатура);
	Выборка = Запрос.Выполнить().Выбрать();
	МассивЕдИзмерений = новый Массив;
	МассивЕдИзмерений.Добавить(ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(Номенклатура));
	Пока Выборка.Следующий() Цикл
		МассивЕдИзмерений.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Для Каждого ЕдИзм Из МассивЕдИзмерений Цикл
		
		Если Дерево.Строки.НайтиСтроки(Новый Структура("Номенклатура, ЕдиницаИзмерения",Номенклатура, ЕдИзм)).Количество()=0 Тогда		
			Стр = Дерево.Строки.Добавить();
			Стр.Номенклатура = Номенклатура;
			Стр.ЕдиницаИзмерения = ЕдИзм;
			ВыборкаХарактеристики = РезультатЗапросаХарактеристики.Выбрать();
			ОбработкаТабличныхЧастейКлиентСервер.ЗаполнитьИндексКартинкиСтрокиДереваЦен(Стр);
			Если ВыборкаХарактеристики.Количество() > 0 Тогда								
			Стр.ХарактеристикиИспользуются = Истина;	
				Пока ВыборкаХарактеристики.Следующий() Цикл
					СтрДеревоВид = Стр.Строки.Добавить();
					СтрДеревоВид.Номенклатура = Стр.Номенклатура;
					СтрДеревоВид.ХарактеристикаНоменклатуры = ВыборкаХарактеристики.Ссылка;
					СтрДеревоВид.ЕдиницаИзмерения = Стр.ЕдиницаИзмерения;
					СтрДеревоВид.ХарактеристикиИспользуются = Истина;
					ОбработкаТабличныхЧастейКлиентСервер.ЗаполнитьИндексКартинкиСтрокиДереваЦен(СтрДеревоВид);
				КонецЦикла;
			КонецЕсли;						
		КонецЕсли;
		
	КонецЦикла;

	ЗначениеВДанныеФормы(Дерево, ДеревоЦен); 	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТоварамиИзДокумента(Команда)
	ОткрытьФорму("Документ.УстановкаЦенНоменклатуры.Форма.ФормаЗаполненияИзДокумента",,ЭтаФорма,,,,
		Новый ОписаниеОповещения("ЗаполнитьТоварамиИзДокументаПриЗавершенииВыбора",ЭтотОбъект));
КонецПроцедуры		

&НаКлиенте
Процедура ЗаполнитьТоварамиИзДокументаПриЗавершенииВыбора(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьТоварамиИзДокументаНаСервере(Результат);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТоварамиИзДокументаНаСервере(ВозвращенноеЗначение)
	
	//ВозвращенноеЗначение.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерений");
	Объект.Товары.Очистить();
	ПоместитьЦеныВТабличнуюЧасть();
	Для Каждого ТекущаяСтрока Из ВозвращенноеЗначение Цикл
		//Попробуем найти в ТЧ Товары
		Отбор = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения",
			ТекущаяСтрока.Номенклатура, ТекущаяСтрока.ХарактеристикаНоменклатуры, ТекущаяСтрока.ЕдиницаИзмерения);						
		НайденноеЗначение = Объект.Товары.НайтиСтроки(Отбор);
		Если НайденноеЗначение.Количество() > 0 Тогда
			НоваяСтрокаТЧ = НайденноеЗначение[0];
		Иначе	
			НоваяСтрокаТЧ = Объект.Товары.Добавить();
		КонецЕсли;	
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ, ТекущаяСтрока);
	КонецЦикла;
	ДеревоЦен.ПолучитьЭлементы().Очистить();
	ЗагрузитьТабличнуюЧастьТовары();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТекущимиЦенами(Команда)
	Если ДеревоЦен.ПолучитьЭлементы().Количество() = 0 Тогда 
		Сообщить("Таблица цен пуста, установка цен не выполнена");
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Контрагент) ИЛИ НЕ ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
		Сообщить("Не указан контрагент или договор контрагента");
	Иначе
		ЗаполнитьТекущимиЦенамиНаСервере();
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекущимиЦенамиНаСервере()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент",Объект.Контрагент);
	Запрос.УстановитьПараметр("ДоговорКонтрагента",Объект.ДоговорКонтрагента);
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Валюта", Объект.Валюта);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦенаНоменклатуры.Номенклатура КАК Номенклатура,
	|	ЦенаНоменклатуры.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЦенаНоменклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЦенаНоменклатуры.Цена КАК Цена,
	|	ЦенаНоменклатуры.ВидЦены КАК ВидЦены
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатурыИндивидуальные.СрезПоследних(&Дата, ) КАК ЦенаНоменклатуры
	|ГДЕ
	|	ЦенаНоменклатуры.Валюта = &Валюта
	|	И ЦенаНоменклатуры.Контрагент = &Контрагент
	|	И ЦенаНоменклатуры.ДоговорКонтрагента = &ДоговорКонтрагента";
	
	ТаблицаЦен = Запрос.Выполнить().Выгрузить();
	
	Дерево = ДеревоЦен.ПолучитьЭлементы();
	Для Каждого СтрокаДерева из Дерево Цикл	
		ЭлементыСтроки = СтрокаДерева.ПолучитьЭлементы();
		Отбор = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения",
				СтрокаДерева.Номенклатура, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(), СтрокаДерева.ЕдиницаИзмерения);
		НайденныеСтроки = ТаблицаЦен.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда
			СтрокаДерева.Цена = НайденныеСтроки[0].Цена;			
			СтрокаДерева.ВидЦены = НайденныеСтроки[0].ВидЦены;
		КонецЕсли;
		// характеристики
		Для Каждого Стр из ЭлементыСтроки Цикл
			Отбор = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения",
						Стр.Номенклатура, Стр.ХарактеристикаНоменклатуры, Стр.ЕдиницаИзмерения);
			НайденныеСтроки = ТаблицаЦен.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() > 0 Тогда
				Стр.Цена = НайденныеСтроки[0].Цена;
				Стр.ВидЦены = НайденныеСтроки[0].ВидЦены;
			КонецЕсли; 	
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбщуюЦену(Команда)
	
	Если ДеревоЦен.ПолучитьЭлементы().Количество() = 0 Тогда 
		Сообщить("Таблица цен пуста, расчет цен не будет выполнен");
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещенияВыборЦены = Новый ОписаниеОповещения("УстановитьОбщуюЦенуНаНоменклатуруПослеВыбораЦены", ЭтотОбъект);
	ПоказатьВводЧисла(ОписаниеОповещенияВыборЦены, 0, "Установить общую цену", 15, 2);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбщуюЦенуНаНоменклатуруПослеВыбораЦены(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ЭлементНоменклатура = ДеревоЦен.ПолучитьЭлементы();
	Для Каждого СтрокаДерева из ЭлементНоменклатура Цикл	
		
		СтрокаДерева.Цена = ВыбранноеЗначение;
		СтрокаДерева.ВидЦены = ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка");
		
		ЭлементХарактеристика = СтрокаДерева.ПолучитьЭлементы();
		// характеристики
		Для Каждого Стр из ЭлементХарактеристика Цикл
			Стр.Цена = ВыбранноеЗначение;
			Стр.ВидЦены = ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка");
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВсеЗначенияНаСумму(Команда)
	
	ПослеВводаСуммыДляИзмененияВсехСтрок = Новый ОписаниеОповещения("ПослеВводаСуммыДляИзмененияВсехСтрок", ЭтаФорма);
	ПоказатьВводЧисла(ПослеВводаСуммыДляИзмененияВсехСтрок,0,"Введите сумму",15,2);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаСуммыДляИзмененияВсехСтрок(Число, Параметры) Экспорт
	Если Число = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Дерево = ДеревоЦен.ПолучитьЭлементы();
	Для Каждого СтрокаДерева из Дерево Цикл	
		ЭлементыСтроки = СтрокаДерева.ПолучитьЭлементы();
		Если СтрокаДерева.ВидЦены = ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка") Тогда
			СтрокаДерева.Цена = СтрокаДерева.Цена + Число;
		КонецЕсли;
		
		// характеристики
		Для Каждого Стр из ЭлементыСтроки Цикл
			Если Стр.ВидЦены = ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка") Тогда
				Стр.Цена = Стр.Цена + Число;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ПоказатьОповещениеПользователя("Цены изменены");
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВсеЗначенияНаПроцент(Команда)
	ПослеВводаПроцентаДляИзмененияВсехСтрок = Новый ОписаниеОповещения("ПослеВводаПроцентаДляИзмененияВсехСтрок", ЭтаФорма);
	ПоказатьВводЧисла(ПослеВводаПроцентаДляИзмененияВсехСтрок,0,"Введите %",15,2);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаПроцентаДляИзмененияВсехСтрок(Число, Параметры) Экспорт
	Если  Число = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Дерево = ДеревоЦен.ПолучитьЭлементы();
	Для Каждого СтрокаДерева из Дерево Цикл	
		ЭлементыСтроки = СтрокаДерева.ПолучитьЭлементы();
		Если СтрокаДерева.ВидЦены = ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка") Тогда
			СтрокаДерева.Цена = СтрокаДерева.Цена + СтрокаДерева.Цена*(Число/100);
		КонецЕсли;
		
		// характеристики
		Для Каждого Стр из ЭлементыСтроки Цикл
			Если Стр.ВидЦены = ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка") Тогда
				Стр.Цена = СтрокаДерева.Цена + Стр.Цена*(Число/100);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ПоказатьОповещениеПользователя("Цены изменены");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбщийВидЦены(Команда)
	
	ОткрытьФорму("Справочник.ВидыЦен.ФормаВыбора",,ЭтаФорма,,,,
		Новый ОписаниеОповещения("УстановитьОбщийВидЦеныПриЗавершенииВыбора",ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбщийВидЦеныПриЗавершенииВыбора(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьОбщийВидЦеныЗавершение", ЭтаФорма, Результат);
	ТекстВопроса = "Установить выбранный ""Вид цены"" для всех строк? При выборе ""Нет"" будет установлено только для выделенных строк.";
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
	
КонецПроцедуры	

&НаКлиенте
Процедура УстановитьОбщийВидЦеныЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ВидЦены = ДополнительныеПараметры;
	ТолькоВыделенныеСтроки = Ложь;	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		ТолькоВыделенныеСтроки = Истина;
	ИначеЕсли Результат = КодВозвратаДиалога.Да Тогда
		ТолькоВыделенныеСтроки = Ложь;
	Иначе
		Возврат;
	КонецЕсли;
	
	Если НЕ ТолькоВыделенныеСтроки Тогда
		
		ЭлементыНоменклатура = ДеревоЦен.ПолучитьЭлементы();
		Для Каждого ЭлементНоменклатура из ЭлементыНоменклатура Цикл			
			ЭлементНоменклатура.ВидЦены = ВидЦены;
			ЭлементНоменклатура.Цена = 0;
			
			ЭлементыХарактеристики = ЭлементНоменклатура.ПолучитьЭлементы();
			Для Каждого ЭлементХарактеристика из ЭлементыХарактеристики Цикл
				ЭлементХарактеристика.ВидЦены = ВидЦены;
				ЭлементХарактеристика.Цена = 0;			
			КонецЦикла;
		КонецЦикла;
	
	Иначе
	
		Для Каждого ВыделеннаяСтрока Из Элементы.ДеревоЦен.ВыделенныеСтроки Цикл
			
			СтрокаТаблицыЦен = ДеревоЦен.НайтиПоИдентификатору(ВыделеннаяСтрока);				
			СтрокаТаблицыЦен.ВидЦены = ВидЦены;
			СтрокаТаблицыЦен.Цена = 0;
			
			Если Не ЗначениеЗаполнено(СтрокаТаблицыЦен.ХарактеристикаНоменклатуры) Тогда	
				ЭлементыХарактеристики = СтрокаТаблицыЦен.ПолучитьЭлементы();				
				Для Каждого ЭлементХарактеристика Из ЭлементыХарактеристики Цикл
					ЭлементХарактеристика.ВидЦены = ВидЦены;
					ЭлементХарактеристика.Цена = 0;
				КонецЦикла;				
			КонецЕсли;			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

//++ №14163
&НаКлиенте
Процедура ЗагрузитьИзExcel(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИспользоватьСумму", Ложь);
	ПараметрыФормы.Вставить("ИспользоватьКоличество", Ложь);
	
	ОткрытьФорму(
		"Обработка.ЗагрузкаНоменклатурыИзExcel.Форма.ЗагрузкаВТабличнуюЧасть",
		ПараметрыФормы,
		ЭтаФорма,
		УникальныйИдентификатор);
		
КонецПроцедуры
	
&НаСервере
Процедура ПолучитьЗагруженныеТоварыИзХранилища(АдресТоваровВХранилище)
	
	ТаблицаНоменклатуры = ПолучитьИзВременногоХранилища(АдресТоваровВХранилище);	
	УстановкаЦенСервер.ДобавитьНоменклатуруВДеревоЦен(ЭтаФорма, ТаблицаНоменклатуры);
	
	Дерево = ДеревоЦен.ПолучитьЭлементы();
	
	Для Каждого СтрокаНоменклатуры из Дерево Цикл		
		
		СтруктураПоиска = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения");
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаНоменклатуры);
		
		НайденныеСтроки = ТаблицаНоменклатуры.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			СтрокаНоменклатуры.Цена = НайденныеСтроки[0].Цена;
			СтрокаНоменклатуры.ВидЦены = Справочники.ВидыЦен.ПустаяСсылка();
			
		КонецЕсли;
		
		СтрокиХарактеристик = СтрокаНоменклатуры.ПолучитьЭлементы();
		Для Каждого СтрокаХарактеристики из СтрокиХарактеристик Цикл
			
			СтруктураПоиска = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения");
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаХарактеристики);
			
			НайденныеСтроки = ТаблицаНоменклатуры.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтроки.Количество() > 0 Тогда
				
				СтрокаХарактеристики.Цена = НайденныеСтроки[0].Цена;
				СтрокаХарактеристики.ВидЦены = Справочники.ВидыЦен.ПустаяСсылка();
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦенамиПоставщика(Команда)
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеВыбораПоставщика", ЭтаФорма);
	
	ПоказатьВводЗначения(ОповещениеОЗакрытии, ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка"), "Укажите поставщика", Тип("СправочникСсылка.Контрагенты"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПоставщика(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Или Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоЦенамПоставщика(Результат);
	
	ПоказатьОповещениеПользователя("Цены изменены");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоЦенамПоставщика(Контрагент)
	
	Дерево = ДеревоЦен.ПолучитьЭлементы();
	Для Каждого ТекущаяНоменклатура Из Дерево Цикл
		
		ТекущаяНоменклатура.Цена = РегистрыСведений.ЦеныПоставщиков.ПолучитьЦенуНоменклатурыВВалюте(ТекущаяДатаСеанса(), Контрагент, ТекущаяНоменклатура.Номенклатура, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(), ТекущаяНоменклатура.ЕдиницаИзмерения, Объект.Валюта);
		ТекущаяНоменклатура.ВидЦены = Справочники.ВидыЦен.ПустаяСсылка();
		
		// Характеристиками
		ЭлементыХарактеристик = ТекущаяНоменклатура.ПолучитьЭлементы();
		Для Каждого ТекущаяСтрока Из ЭлементыХарактеристик Цикл
			
			ТекущаяСтрока.Цена = РегистрыСведений.ЦеныПоставщиков.ПолучитьЦенуНоменклатурыВВалюте(ТекущаяДатаСеанса(), Контрагент, ТекущаяСтрока.Номенклатура, ТекущаяСтрока.ХарактеристикаНоменклатуры, ТекущаяСтрока.ЕдиницаИзмерения, Объект.Валюта);
			ТекущаяСтрока.ВидЦены = Справочники.ВидыЦен.ПустаяСсылка();
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры
//-- №14163

&НаКлиенте
Процедура ОкруглитьЦены(Команда)

	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораПравилОкругления", ЭтотОбъект);
	ПараметрыФормы = Новый Структура("ТипВладельца", "УстановкаЦенНоменклатуры");
	ОткрытьФорму("ОбщаяФорма.ФормаНастроекОкругления", ПараметрыФормы,,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПравилОкругления(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПорядокОкругления = Результат.ПорядокОкругления;
	ОкруглятьВБольшуюСторону = Результат.ОкруглятьВБольшуюСторону;	

	СтрокиНоменклатуры = ДеревоЦен.ПолучитьЭлементы();
	Для Каждого СтрокаНоменклатуры из СтрокиНоменклатуры Цикл
		Если СтрокаНоменклатуры.ВидЦены = ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка")	
			И ЗначениеЗаполнено(СтрокаНоменклатуры.Цена) Тогда
			СтрокаНоменклатуры.Цена = ОбщийМодуль.ОкруглитьЧисло(СтрокаНоменклатуры.Цена, ПорядокОкругления, ОкруглятьВБольшуюСторону);	
		КонецЕсли;		
		//характеристики
		СтрокиХарактеристик = СтрокаНоменклатуры.ПолучитьЭлементы();
		Для Каждого СтрокаХарактеристики из СтрокиХарактеристик Цикл
			Если СтрокаХарактеристики.ВидЦены = ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка")	
				И ЗначениеЗаполнено(СтрокаХарактеристики.Цена) Тогда
				СтрокаХарактеристики.Цена = ОбщийМодуль.ОкруглитьЧисло(СтрокаХарактеристики.Цена, ПорядокОкругления, ОкруглятьВБольшуюСторону);
			КонецЕсли;			
		КонецЦикла;
	КонецЦикла;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьЦены(Команда)
	
	Если ДеревоЦен.ПолучитьЭлементы().Количество()=0 Тогда 
		Сообщить("Таблица цен пуста, расчет цен не будет выполнен");
		Возврат;
	КонецЕсли;
	
	сз_ВсеВидыЦен = Новый СписокЗначений;
	Для каждого Строка Из ВидыЦен Цикл
		Если НЕ Строка.Запрещенный Тогда
			сз_ВсеВидыЦен.Добавить(Строка.ВидЦены);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("УстановкаИндивидуальныхЦенНоменклатуры", Истина);
	ПараметрыФормы.Вставить("ВсеВидыЦен",			сз_ВсеВидыЦен);
	ПараметрыФормы.Вставить("ИспользуемыеВидыЦен",	Новый СписокЗначений);
	ПараметрыФормы.Вставить("РазрешенныеВидыЦен",	Новый СписокЗначений);
	ОписаниеОповещения = Новый ОписаниеОповещения("РассчитатьЦеныФрагмент", ЭтотОбъект);
	ОткрытьФорму("Документ.УстановкаЦенНоменклатуры.Форма.ФормаРасчетаЦен", ПараметрыФормы, ЭтаФорма, , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьЦеныФрагмент(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("РассчитатьЦеныЗавершение", ЭтотОбъект, Результат); 
	ТекстВопроса = "Цены будут перерассчитаны. Продолжить?";
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьЦеныЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Модифицированность = Истина;
		РассчитатьЦеныНаСервере(ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьЦеныНаСервере(ПараметрыРасчета)
	
	ВидИсходныхДанных = ПараметрыРасчета.ВидИсходныхДанных;
	ИсходныйВидЦен = ПараметрыРасчета.ИсходныйВидЦен;
	ПроцентНаценки = ПараметрыРасчета.ПроцентНаценки;	
		
	Объект.Товары.Очистить();
	ПоместитьЦеныВТабличнуюЧасть();
		
	Если ВидИсходныхДанных = 0 Тогда
		//наценка на себестоимость
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДатаЗапроса",?(Объект.Дата = Дата(1,1,1),ТекущаяДатаСеанса(),Объект.Дата));
		Запрос.УстановитьПараметр("МассивНоменклатуры", Объект.Товары.Выгрузить().ВыгрузитьКолонку("Номенклатура"));			
		Запрос.УстановитьПараметр("Склад", ПараметрыРасчета.СкладОстатков);
		Запрос.УстановитьПараметр("Организация", ПараметрыРасчета.Организация);
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ТоварыНаСкладахОстатки.Номенклатура.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА НЕ ТоварыНаСкладахОстатки.КоличествоОстаток = 0
		|				ТОГДА ТоварыНаСкладахОстатки.СуммаОстаток / ТоварыНаСкладахОстатки.КоличествоОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК Цена
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(
		|			&ДатаЗапроса,
		|			(Организация = &Организация ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
		|				И Номенклатура в (&МассивНоменклатуры)
		|				И ВЫБОР
		|					КОГДА НЕ &Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|						ТОГДА Склад = &Склад
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ) КАК ТоварыНаСкладахОстатки";
		
		ТаблицаИсточник = Запрос.Выполнить().Выгрузить(); 			
		ЗаполнитьЦеныПоТаблице(ТаблицаИсточник, ПроцентНаценки, Истина);
		
	ИначеЕсли ВидИсходныхДанных = 1 Тогда
		//наценка на цену последней покупки без доставки (т.е. цена в поступлении)
			
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДатаЗапроса", КонецДня(?(Объект.Дата = Дата(1,1,1), ТекущаяДатаСеанса(), Объект.Дата)));
		Запрос.УстановитьПараметр("МассивНоменклатуры", Объект.Товары.Выгрузить().ВыгрузитьКолонку("Номенклатура"));			
		Запрос.УстановитьПараметр("Организация", ПараметрыРасчета.Организация);
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПоступлениеТоваровИУслугТовары.Номенклатура КАК Номенклатура,
		|	ПоступлениеТоваровИУслугТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ПоступлениеТоваровИУслугТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ПоступлениеТоваровИУслугТовары.Цена
		|ИЗ
		|	Документ.ПоступлениеТоваровИУслуг.Товары КАК ПоступлениеТоваровИУслугТовары
		|ГДЕ
		|	ПоступлениеТоваровИУслугТовары.Номенклатура В (&МассивНоменклатуры)
		|	И ПоступлениеТоваровИУслугТовары.Ссылка.Проведен
		|	И ПоступлениеТоваровИУслугТовары.Ссылка.Дата <= &ДатаЗапроса
		|	И (ПоступлениеТоваровИУслугТовары.Ссылка.Организация = &Организация ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПоступлениеТоваровИУслугТовары.Ссылка.Дата Убыв";
		
		ТаблицаИсточник = Запрос.Выполнить().Выгрузить();		
		ЗаполнитьЦеныПоТаблице(ТаблицаИсточник, ПроцентНаценки);
		
	ИначеЕсли ВидИсходныхДанных = 2 Тогда
		// наценка на цену последней покупки + доставка
			
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДатаЗапроса", КонецДня(?(Объект.Дата = Дата(1,1,1), ТекущаяДатаСеанса(), Объект.Дата)));
		Запрос.УстановитьПараметр("МассивНоменклатуры", Объект.Товары.Выгрузить().ВыгрузитьКолонку("Номенклатура"));			
		Запрос.УстановитьПараметр("Организация", ПараметрыРасчета.Организация);
		Запрос.Текст =	
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗакупкиОбороты.Номенклатура КАК Номенклатура,
		|	ЗакупкиОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ЗакупкиОбороты.Номенклатура.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА НЕ ЗакупкиОбороты.КоличествоОборот = 0
		|				ТОГДА ЗакупкиОбороты.СуммаОборот / ЗакупкиОбороты.КоличествоОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК Цена
		|ИЗ
		|	РегистрНакопления.Закупки.Обороты(
		|			,
		|			&ДатаЗапроса,
		|			Регистратор,
		|			(Организация = &Организация ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
		|				И Номенклатура В (&МассивНоменклатуры)) КАК ЗакупкиОбороты
		|ГДЕ
		|	ЗакупкиОбороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваровИУслуг
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗакупкиОбороты.Период Убыв";
		
		ТаблицаИсточник = Запрос.Выполнить().Выгрузить();		
		ЗаполнитьЦеныПоТаблице(ТаблицаИсточник, ПроцентНаценки, Истина);			

	ИначеЕсли ВидИсходныхДанных = 4 Тогда
		//наценка на указанный вид цен
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДатаЗапроса",?(Объект.Дата = Дата(1,1,1), ТекущаяДатаСеанса(), Объект.Дата));
		Запрос.УстановитьПараметр("ВидЦены", ИсходныйВидЦен);
		Запрос.УстановитьПараметр("Валюта",  Объект.Валюта);
		Запрос.УстановитьПараметр("МассивНоменклатуры", Объект.Товары.Выгрузить().ВыгрузитьКолонку("Номенклатура"));
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЦеныСрезПоследних.Валюта КАК Валюта,
		|	ЦеныСрезПоследних.ВидЦены КАК ВидЦены,
		|	ЦеныСрезПоследних.Номенклатура КАК Номенклатура,
		|	ЦеныСрезПоследних.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ЦеныСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ЦеныСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			&ДатаЗапроса,
		|			ВидЦены = &ВидЦены
		|				И Валюта = &Валюта
		|				И Номенклатура В (&МассивНоменклатуры)) КАК ЦеныСрезПоследних";
		
		ТаблицаИсточник = Запрос.Выполнить().Выгрузить();		
		ЗаполнитьЦеныПоТаблице(ТаблицаИсточник, ПроцентНаценки);			
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийВкладкиЦеныНоменклатуры

&НаКлиенте
Процедура ИндивидуальныеЦеныНоменклатурыПриИзменении(Элемент)
	УстановитьВидимость();	
КонецПроцедуры

#Область ОбработчикиСобытийДереваЦен

&НаКлиенте
Процедура ДеревоЦенПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	// для запрета ввода по Insert
	Если НЕ Копирование Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЦенПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ТекущиеДанные = Элементы.ДеревоЦен.ТекущиеДанные;
	СтараяНоменклатура = ТекущиеДанные.Номенклатура;
	СтараяХарактеристика = ТекущиеДанные.ХарактеристикаНоменклатуры;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЦенПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	ТекущиеДанные = Элементы.ДеревоЦен.ТекущиеДанные;
	
	Если ТекущиеДанные.Номенклатура <> СтараяНоменклатура Тогда
		
		ЭлементыНоменклатура = ДеревоЦен.ПолучитьЭлементы();
		Для Каждого ЭлементНоменклатура Из ЭлементыНоменклатура Цикл
			Если ЭлементНоменклатура.Номенклатура = ТекущиеДанные.Номенклатура Тогда
				Если ТекущиеДанные.ПолучитьИдентификатор() <> ЭлементНоменклатура.ПолучитьИдентификатор() Тогда
					Если Не ОтменаРедактирования Тогда
						Отказ = Истина;
						ОчиститьСообщения();
						Сообщить(НСтр("ru = 'Такая номенклатура уже введена.'"));
					Иначе
						ТекущиеДанные.Номенклатура = СтараяНоменклатура;
						ТекущиеДанные.ХарактеристикаНоменклатуры = СтараяХарактеристика;
					КонецЕсли;
					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;	
		
		ДеревоЦен.ПолучитьЭлементы().Удалить(ТекущиеДанные);
		ДобавитьНоменклатуруНаСервере(ТекущиеДанные.Номенклатура);
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		Если Не ОтменаРедактирования Тогда
			Отказ = Истина;
			ОчиститьСообщения();
			Сообщить(НСтр("ru = 'Номенклатура не выбрана.'"));
		Иначе
			ТекущиеДанные.Номенклатура = СтараяНоменклатура;
			ТекущиеДанные.ХарактеристикаНоменклатуры = СтараяХарактеристика;
		КонецЕсли;
	КонецЕсли;
	
	Если ТекущиеДанные.ХарактеристикаНоменклатуры <> СтараяХарактеристика Тогда
		
		ЭлементыХарактеристики = ДеревоЦен.НайтиПоИдентификатору(Элементы.ДеревоЦен.ТекущаяСтрока);
		
		Если ЭлементыХарактеристики.ПолучитьРодителя() = Неопределено Тогда
			ЭлементыХарактеристики = ЭлементыХарактеристики.ПолучитьЭлементы();
		Иначе
			ЭлементыХарактеристики = ЭлементыХарактеристики.ПолучитьРодителя().ПолучитьЭлементы();
		КонецЕсли;
		Для Каждого ЭлементХарактеристика Из ЭлементыХарактеристики Цикл
			Если ЭлементХарактеристика.ХарактеристикаНоменклатуры = ТекущиеДанные.ХарактеристикаНоменклатуры Тогда
				Если ТекущиеДанные.ПолучитьИдентификатор() <> ЭлементХарактеристика.ПолучитьИдентификатор() Тогда
					Если Не ОтменаРедактирования Тогда
						Отказ = Истина;
						ОчиститьСообщения();
						Сообщить(НСтр("ru = 'Такая характеристика для данной номенклатуры уже введена.'"));
					Иначе
						ТекущиеДанные.Номенклатура = СтараяНоменклатура;
						ТекущиеДанные.ХарактеристикаНоменклатуры = СтараяХарактеристика;
					КонецЕсли;
					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;	
		
	КонецЕсли;


КонецПроцедуры

&НаКлиенте
Процедура ДеревоЦенПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если НЕ Элемент.ТекущиеДанные = Неопределено Тогда
		ОбработкаТабличныхЧастейКлиентСервер.ЗаполнитьИндексКартинкиСтрокиДереваЦен(Элемент.ТекущиеДанные); 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЦенЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтрокаТабличнойЧасти = Элементы.ДеревоЦен.ТекущиеДанные;
	СписокЕдиниц = ОбщийМодуль.ПолучитьСписокЕдиницИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Ном = 0 По СписокЕдиниц.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(СписокЕдиниц[Ном]);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЦенЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоЦен.ТекущиеДанные;
	ТекущаяСтрока = ДеревоЦен.НайтиПоИдентификатору(ТекущиеДанные.ПолучитьИдентификатор());
	ИмяТекущейКолонки  = СтрЗаменить(Элемент.Имя, "ДеревоЦен", "");
	
	ТекущиеДанные.ВидЦены = ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка");
	ТекущиеДанные.Наценка = 0;
	Если ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		//Цену поставили у родителя, нужно проставить у подчиненных
		ТекущееЗначение = ТекущиеДанные[ИмяТекущейКолонки];
		ЭлементыХарактеристики = ТекущаяСтрока.ПолучитьЭлементы();
		
		Для Каждого ЭлементХарактеристика Из ЭлементыХарактеристики Цикл			
			ЭлементХарактеристика[ИмяТекущейКолонки] = ТекущееЗначение;
			ЭлементХарактеристика.ВидЦены = ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка");
		КонецЦикла;		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЦенВидЦеныПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоЦен.ТекущиеДанные;
	ТекущаяСтрока = ДеревоЦен.НайтиПоИдентификатору(ТекущиеДанные.ПолучитьИдентификатор());
	ИмяТекущейКолонки  = СтрЗаменить(Элемент.Имя, "ДеревоЦен", "");
	
	ТекущиеДанные.Цена = 0;
	Если ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		//Цену поставили у родителя, нужно проставить у подчиненных
		ТекущееЗначение = ТекущиеДанные[ИмяТекущейКолонки];
		ЭлементыХарактеристики = ТекущаяСтрока.ПолучитьЭлементы();
		
		Для Каждого ЭлементХарактеристика Из ЭлементыХарактеристики Цикл			
			ЭлементХарактеристика[ИмяТекущейКолонки] = ТекущееЗначение;
			ЭлементХарактеристика.Цена = 0;
		КонецЦикла;		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура РазвернутьДеревоДокумента(Команда)
	
	УстановкаЦенКлиент.РазвернутьДеревоЦен(Элементы, ДеревоЦен);
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьДеревоЦенДокумента(Команда)
	
	УстановкаЦенКлиент.СвернутьДеревоЦен(Элементы, ДеревоЦен);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНоменклатуру(Команда)
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора",,ЭтаФорма,,,,
		Новый ОписаниеОповещения("ДобавитьНоменклатуруПриЗавершенииВыбора",ЭтотОбъект));
КонецПроцедуры
	
&НаКлиенте
Процедура ДобавитьНоменклатуруПриЗавершенииВыбора(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ДобавитьНоменклатуруНаСервере(Результат);
	Модифицированность = Истина;
		
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьХарактеристику(Команда)
	
	ТекущиеДанные = Элементы.ДеревоЦен.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено ИЛИ Не ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Для того, чтобы выбрать характеристику Вам необходимо предварительно выбрать номенклатуру.'"));
		Возврат;
	КонецЕсли;
	
	Если НЕ ИспользуютсяХарактеристикиНоменклатуры(ТекущиеДанные.Номенклатура) Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Для данной номенклатуры характеристики не используются.'"));
		Возврат;
	КонецЕсли;	
	
	Отбор = новый Структура;
	Отбор.Вставить("Владелец", ТекущиеДанные.Номенклатура);
	
	ПараметрыФормыВыбора = Новый Структура;	
	ПараметрыФормыВыбора.Вставить("Отбор", Отбор);	
	
	ОткрытьФорму("Справочник.ХарактеристикиНоменклатуры.ФормаВыбора", ПараметрыФормыВыбора,,,,, Новый ОписаниеОповещения("ДобавитьХарактеристикуЗавершение", ЭтотОбъект, Новый Структура("ТекущиеДанные", ТекущиеДанные)), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьХарактеристикуЗавершение(Результат, ДопПараметры)  Экспорт
	
	ТекущиеДанные = ДопПараметры.ТекущиеДанные;    
    
    Характеристика = Результат;
    Если Характеристика = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    ЭлементыХарактеристики = ДеревоЦен.НайтиПоИдентификатору(Элементы.ДеревоЦен.ТекущаяСтрока);
    Если ЭлементыХарактеристики.ПолучитьРодителя() = Неопределено Тогда
        ЭлементыХарактеристики = ЭлементыХарактеристики.ПолучитьЭлементы();
    Иначе
        ЭлементыХарактеристики = ЭлементыХарактеристики.ПолучитьРодителя().ПолучитьЭлементы();
    КонецЕсли;
    Для Каждого ЭлементХарактеристика Из ЭлементыХарактеристики Цикл
        Если ЭлементХарактеристика.ХарактеристикаНоменклатуры = Характеристика Тогда
            Элементы.ДеревоЦен.ТекущаяСтрока = ЭлементХарактеристика.ПолучитьИдентификатор();;
            ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Такая характеристика для данной номенклатуры уже введена.'"));
            Возврат;
        КонецЕсли;
    КонецЦикла;
    
    ТекущийРодитель = ТекущиеДанные.ПолучитьРодителя();
    Если ТекущийРодитель = Неопределено Тогда
        ТекущийРодитель = ТекущиеДанные;
    КонецЕсли;
    НоваяСтрока = ТекущийРодитель.ПолучитьЭлементы().Добавить();
    Элементы.ДеревоЦен.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
    
    ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущийРодитель, , "ХарактеристикаНоменклатуры");
    
    НоваяСтрока.ХарактеристикаНоменклатуры = Характеристика;    
    //НоваяСтрока.ИндексКартинки = 2;
	ОбработкаТабличныхЧастейКлиентСервер.ЗаполнитьИндексКартинкиСтрокиДереваЦен(НоваяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура Подобрать(Команда)
		
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("Дата",					Объект.Дата);
	ПараметрыПодбора.Вставить("ВидНоменклатуры",		ПолучитьСписокВидовНоменклатуры());
	ПараметрыПодбора.Вставить("НеЗапрашиватьЦену",			Истина);
	ПараметрыПодбора.Вставить("НеЗапрашиватьКоличество",	Истина);
	
	УстановкаЦенКлиент.ОткрытьФормуПодбораНоменклатуры(ПараметрыПодбора, ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПодбораНоменклатурыНаКлиенте(ВыбранноеЗначение)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
			
	ОбработкаПодбораНоменклатурыНаСервере(ВыбранноеЗначение);
		
КонецПроцедуры

&НаСервере
Функция ОбработкаПодбораНоменклатурыНаСервере(ВыбранноеЗначение)
	
	ТаблицаНоменклатуры = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресВХранилище);
	УстановкаЦенСервер.ДобавитьНоменклатуруВДеревоЦен(ЭтаФорма, ТаблицаНоменклатуры);
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПоГруппеНоменклатуры(Команда)
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбораГруппы",,ЭтаФорма,,,,
		Новый ОписаниеОповещения("ЗаполнитьПоГруппеПриЗавершенииВыбора",ЭтотОбъект));
КонецПроцедуры
	
&НаКлиенте
Процедура ЗаполнитьПоГруппеПриЗавершенииВыбора(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьПоГруппеНоменклатурыНаСервере(Результат);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоГруппеНоменклатурыНаСервере(ГруппаНоменклатуры)
	
	УстановкаЦенСервер.ЗаполнитьНоменклатуруПоГруппе(ЭтаФорма, ГруппаНоменклатуры);
	
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеФункцииПроцедуры

&НаСервере
Процедура ЗагрузитьТабличнуюЧастьТовары()
	
	ТаблицаТоваров = Объект.Товары.Выгрузить();	
	КЭШ = СоздатьТаблицуНоменклатуры();
	КЭШ.Колонки.Добавить("СтрокаДереваЦен");
	КЭШ.Индексы.Добавить("Номенклатура, ЕдиницаИзмерения");
	
	Если ТипЗнч(ДеревоЦен) = Тип("ДанныеФормыКоллекция") Тогда
		ЭлементыДереваЦен = ДеревоЦен;
	Иначе
		ЭлементыДереваЦен = ДеревоЦен.ПолучитьЭлементы();		
	КонецЕсли;
	
	Для Каждого ТекНоменклатура Из ТаблицаТоваров Цикл
		
		ИспользуютсяХарактеристики = ИспользуютсяХарактеристикиНоменклатуры(ТекНоменклатура.Номенклатура);
		НайденнаяСтрока = НайтиСтрокуДереваЦен(ТекНоменклатура, КЭШ);
		Если НайденнаяСтрока <> Неопределено Тогда
			ЭлементНоменклатура = НайденнаяСтрока.СтрокаДереваЦен;
		Иначе
			ЭлементНоменклатура = ЭлементыДереваЦен.Добавить();
			ЗаполнитьЗначенияСвойств(ЭлементНоменклатура, ТекНоменклатура);
			ЭлементНоменклатура.ХарактеристикиИспользуются = ИспользуютсяХарактеристики;
			ЭлементНоменклатура.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
			ОбработкаТабличныхЧастейКлиентСервер.ЗаполнитьИндексКартинкиСтрокиДереваЦен(ЭлементНоменклатура);
			НоваяСтрокаТЗ = КЭШ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТЗ, ЭлементНоменклатура);
			НоваяСтрокаТЗ.СтрокаДереваЦен = ЭлементНоменклатура;
		КонецЕсли;
		
		Если ИспользуютсяХарактеристики Тогда
			Родитель = ЭлементНоменклатура;
			НайденнаяСтрокаХарактеристики = НайтиСтрокуДереваЦен(ТекНоменклатура, КЭШ, Истина);
			Если НайденнаяСтрокаХарактеристики <> Неопределено Тогда
				ЭлементНоменклатура = НайденнаяСтрокаХарактеристики.СтрокаДереваЦен;
			Иначе	
				ЭлементНоменклатура = ЭлементНоменклатура.ПолучитьЭлементы().Добавить();
				ЗаполнитьЗначенияСвойств(ЭлементНоменклатура, ТекНоменклатура);
				ЭлементНоменклатура.ХарактеристикаНоменклатуры = ТекНоменклатура.ХарактеристикаНоменклатуры;
				ЭлементНоменклатура.ХарактеристикиИспользуются = ИспользуютсяХарактеристики;
				ОбработкаТабличныхЧастейКлиентСервер.ЗаполнитьИндексКартинкиСтрокиДереваЦен(ЭлементНоменклатура);
				НоваяСтрокаТЗ = КЭШ.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаТЗ, ЭлементНоменклатура);
				НоваяСтрокаТЗ.СтрокаДереваЦен = ЭлементНоменклатура
			КонецЕсли;		
			
		КонецЕсли;	
					
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СоздатьТаблицуНоменклатуры() Экспорт
	
	ТаблицаЗначений = Новый ТаблицаЗначений();
	
	ТаблицаЗначений.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаЗначений.Колонки.Добавить("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	МассивТипов = новый Массив;
	МассивТипов.Добавить("СправочникСсылка.ЕдиницаИзмерения");
	МассивТипов.Добавить("СправочникСсылка.КлассификаторЕдиницИзмерения");
	ТаблицаЗначений.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов(МассивТипов));	
	
	Возврат ТаблицаЗначений;
	
КонецФункции

&НаСервере
Функция НайтиСтрокуДереваЦен(ДанныеПоиска, КЭШ, ПоискХарактеристики = Ложь)

	Отбор = Новый Структура("Номенклатура, ЕдиницаИзмерения", ДанныеПоиска.Номенклатура, ДанныеПоиска.ЕдиницаИзмерения);
	Если ПоискХарактеристики Тогда
    	Отбор.Вставить("ХарактеристикаНоменклатуры", ДанныеПоиска.ХарактеристикаНоменклатуры);
	КонецЕсли;				
	
	МассивСтрок = КЭШ.НайтиСтроки(Отбор);
	Если МассивСтрок.Количество() > 0 Тогда
		Возврат МассивСтрок[0];			
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ПоместитьЦеныВТабличнуюЧасть()
	
	Объект.Товары.Очистить();	
	
	ЭлементыНоменклатура = ДеревоЦен.ПолучитьЭлементы();
	Для Каждого ТекЭлементНоменклатура Из ЭлементыНоменклатура Цикл
		
		ПоместитьСтрокуЦенВТабличнуюЧасть(ТекЭлементНоменклатура);
				
		ЭлементыХарактеристики = ТекЭлементНоменклатура.ПолучитьЭлементы();
		Для Каждого ТекЭлементХарактеристика Из ЭлементыХарактеристики Цикл
			
			ПоместитьСтрокуЦенВТабличнуюЧасть(ТекЭлементХарактеристика);
						
		КонецЦикла;
		
	КонецЦикла;		
	
КонецПроцедуры

&НаСервере
Процедура ПоместитьСтрокуЦенВТабличнуюЧасть(СтрокаЦен)
	
	НоваяСтрока = Объект.Товары.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЦен);			
	
КонецПроцедуры

&НаСервере
Функция ИспользуютсяХарактеристикиНоменклатуры(Номенклатура)
	
	Возврат Справочники.Номенклатура.ИспользуютсяХарактеристикиНоменклатуры(Номенклатура);	
	
КонецФункции

&НаСервере
Функция ПолучитьСписокВидовНоменклатуры()
	
	Список = Новый СписокЗначений;
	Список.Добавить(Справочники.ВидыНоменклатуры.Материал);
	Список.Добавить(Справочники.ВидыНоменклатуры.Полотно);
	Список.Добавить(Справочники.ВидыНоменклатуры.Потолок);
	Список.Добавить(Справочники.ВидыНоменклатуры.Отрез);
	Список.Добавить(Справочники.ВидыНоменклатуры.Услуга);
	Возврат Список;
	
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();

	//Отметка незаполненного у номенклатур с характеристиками
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоЦенХарактеристикаНоменклатуры.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоЦен.ИндексКартинки");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 2;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоЦен.ХарактеристикаНоменклатуры");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина); 
	
	//Только просмотр для номенклатуры подчиненных элементов, чтобы только характеристику можно было изменить
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоЦенНоменклатура.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоЦен.ИндексКартинки");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 2;

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	//Только просмотр для характеристики у родителя
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоЦенХарактеристикаНоменклатуры.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоЦен.ИндексКартинки");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоЦен.ХарактеристикиИспользуются");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	//Характеристика не используется
	УстановитьУсловноеОформлениеХарактеристикНоменклатуры(ЭтаФорма, "ДеревоЦенХарактеристикаНоменклатуры", "ДеревоЦен.ХарактеристикиИспользуются");
	
	//Подсветка операции Отмена
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ВидОперации.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВидОперации");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ВидыОперацийУстановкиИндивидуальныхЦен.Отмена;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Персиковый);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеХарактеристикНоменклатуры(Форма, ИмяПоляВводаХарактеристики, ПутьКПолюОтбора) Экспорт
						
	НовУсловноеОформление = Форма.УсловноеОформление;
	ЭлементыФормы = Форма.Элементы;
	
	ЭлементУсловногоОформления = НовУсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ЭлементыФормы[ИмяПоляВводаХарактеристики].Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьКПолюОтбора);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<характеристики не используются>'"));
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(Знач Номенклатура)
	Возврат Номенклатура.БазоваяЕдиницаИзмерения;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьАльтернативнуюЕдиницуИзмеренияНоменклатуры(Знач Номенклатура)
	Возврат Номенклатура.АльтернативнаяЕдиницаИзмерения;
КонецФункции

&НаСервере
Функция УстановитьВидимость()
	
	Элементы.ДеревоЦенГруппаСпособУточненияЦены.Видимость = НЕ Объект.ВидОперации = Перечисления.ВидыОперацийУстановкиИндивидуальныхЦен.Отмена;
	
КонецФункции

&НаСервере
Функция ЗаполнитьЦеныПоТаблице(ТаблицаИсточник, ПроцентНаценки, ПрименятьКоэффициентЕдиницыИзмерения = Ложь)
	
	СтрокиНоменклатуры = ДеревоЦен.ПолучитьЭлементы();
	Для Каждого СтрокаНоменклатуры из СтрокиНоменклатуры Цикл
		СтрокиХарактеристик = СтрокаНоменклатуры.ПолучитьЭлементы();
		Если СтрокиХарактеристик.Количество() = 0 Тогда
			// номенклатура
			ДопКоэффициент = 1;
			СтруктураОтбора = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения");
			Если ПрименятьКоэффициентЕдиницыИзмерения И ТипЗнч(СтрокаНоменклатуры.ЕдиницаИзмерения) = Тип("СправочникСсылка.ЕдиницыИзмерений") Тогда
				ДопКоэффициент = СтрокаНоменклатуры.ЕдиницаИзмерения.Коэффициент;					
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(СтруктураОтбора, СтрокаНоменклатуры);
			НайденныеСтроки = ТаблицаИсточник.НайтиСтроки(СтруктураОтбора);					
			Если НайденныеСтроки.Количество() > 0 Тогда
				СтрокаНоменклатуры.Цена = НайденныеСтроки[0].Цена * (1 + ПроцентНаценки/100) * ДопКоэффициент;
			КонецЕсли;					
		Иначе
			// характеристики
			Для Каждого СтрокаХарактеристики из СтрокиХарактеристик Цикл
				ДопКоэффициент = 1;
				СтруктураОтбора = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения");
				Если ПрименятьКоэффициентЕдиницыИзмерения И ТипЗнч(СтрокаХарактеристики.ЕдиницаИзмерения) = Тип("СправочникСсылка.ЕдиницыИзмерений") Тогда
					ДопКоэффициент = СтрокаХарактеристики.ЕдиницаИзмерения.Коэффициент;					
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(СтруктураОтбора, СтрокаХарактеристики);
				НайденныеСтроки = ТаблицаИсточник.НайтиСтроки(СтруктураОтбора);					
				Если НайденныеСтроки.Количество() > 0 Тогда
					СтрокаХарактеристики.Цена = НайденныеСтроки[0].Цена * (1 + ПроцентНаценки/100) * ДопКоэффициент;
				КонецЕсли;						
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции
	
#КонецОбласти
